coin-selfservice-war/lastLmngRequest.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <CrmAuthenticationToken xmlns="http://schemas.microsoft.com/crm/2007/WebServices">
      <AuthenticationType xmlns="http://schemas.microsoft.com/crm/2007/CoreTypes">0</AuthenticationType>
      <OrganizationName xmlns="http://schemas.microsoft.com/crm/2007/CoreTypes">SURFdienstenBV</OrganizationName>
      <CallerId xmlns="http://schemas.microsoft.com/crm/2007/CoreTypes">00000000-0000-0000-0000-000000000000</CallerId>
    </CrmAuthenticationToken>
  </soap:Header>
  <soap:Body>
    <Fetch xmlns="http://schemas.microsoft.com/crm/2007/WebServices">
      <fetchXml>
      	<fetch version="1.0" output-format="xml-platform" mapping="logical" distinct="true">
  <entity name="account">
    <attribute name="name"/>
    <attribute name="statuscode"/>
    <attribute name="accountid"/>
    <attribute name="websiteurl"/>
    <attribute name="surf_isinstelling"/>
    <attribute name="surf_ss_authentication_domain"/>
    <filter type="and">
      <condition attribute="accountid" operator="eq" value="{ED3207DC-1910-DC11-A6C7-0019B9DE3AA4}"/>
    </filter>
    <order attribute="name" descending="false"/>
    <link-entity name="lmng_licenseagreement" from="lmng_organisationid" to="accountid" alias="license">
      <attribute name="lmng_number"/>
      <attribute name="lmng_validfrom"/>
      <attribute name="lmng_validto"/>
      <filter type="and">
        <condition attribute="lmng_validfrom" operator="on-or-before" value="2012-10-11"/>
        <condition attribute="lmng_validto" operator="on-or-after" value="2012-10-11"/>
        <condition attribute="statuscode" operator="eq" value="4"/>
      </filter>
      <link-entity name="lmng_productvariation" from="lmng_productvariationid" to="lmng_productvariationid" alias="productvariation">
        <attribute name="lmng_name"/>
        <attribute name="lmng_productvariationid"/>
        <attribute name="lmng_description"/>
        <attribute name="lmng_deliverymethodid" />
        <filter type="and">
          <condition attribute="lmng_licensemodel" operator="eq" value="2"/>
        </filter>
        <link-entity name="lmng_product" from="lmng_productid" to="lmng_productid" alias="product">
          <attribute name="lmng_name"/>
          <attribute name="lmng_description"/>
          <attribute name="lmng_descriptionlong"/>
          <link-entity name="lmng_image" from="lmng_imageid" to="lmng_productimageid" alias="image" link-type="outer">
            <attribute name="lmng_url"/>
          </link-entity>
          <link-entity name="account" from="accountid" to="lmng_accountid" alias="supplier">
            <attribute name="name"/>
          </link-entity>
          <link-entity name="lmng_mediationagreement" from="lmng_mediationagreementid" to="lmng_mediationagreementid" alias="mediationagreement">
            <filter type="and">
              <condition attribute="lmng_agreementtype" operator="eq" value="1"/>
            </filter>
          </link-entity>
          <link-entity name="lmng_sdnarticle_lmng_product" from="lmng_productid" to="lmng_productid" visible="false" intersect="true">
            <link-entity name="lmng_sdnarticle" from="lmng_sdnarticleid" to="lmng_sdnarticleid" alias="artikel">
              <filter>
                <condition attribute="lmng_sdnarticleid" operator="eq" value="8833CEAE-960C-E211-B6B9-005056950050"/>
              </filter>
              <all-attributes/>
            </link-entity>
          </link-entity>
        </link-entity>
      </link-entity>
    </link-entity>
    <link-entity name="contact" from="contactid" to="primarycontactid" visible="false" link-type="outer" alias="contact">
      <attribute name="fullname"/>
      <attribute name="emailaddress1"/>
      <attribute name="jobtitle"/>
    </link-entity>
  </entity>
</fetch>


      </fetchXml>
    </Fetch>
  </soap:Body>
</soap:Envelope>